{
  "add_cross_attention": false,
  "architectures": [
    "CaLmForPreTraining"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 1,
  "codon": true,
  "dtype": "float32",
  "emb_layer_norm_before": false,
  "eos_token_id": 2,
  "head": null,
  "hidden_act": "gelu",
  "hidden_dropout": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "LABEL_0": 0
  },
  "layer_norm_eps": 1e-12,
  "lm_head": null,
  "mask_token_id": 4,
  "max_position_embeddings": 1026,
  "model_type": "calm",
  "null_token_id": 5,
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "rotary",
  "token_dropout": false,
  "transformers_version": "5.0.0",
  "unk_token_id": 3,
  "use_cache": true,
  "vocab_size": 131
}
